Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Tales of Sarimin The Jinn.tmx
Source language: id
Languages: en

source: Jawab aku..
en: answer me.

source: VROOOMMMM
en: vroom

source: SIAPA KAMU?!
en: think you are?

source: SURAT PENGUNDURAN DIRI
en: his resignation letter

source: HNGHHH--!
en: Ughhh!

source: SATU SEMESTER!
en: semester!

source: SEPERTI INI..
en: would happen.

source: AKU TIDAK AKAN KALAH DARI MONYET INI...!!!!!!
en: I’m not giving it to this monkey!

source: BERARTI AKU
en: I have to drive

source: DAH?
en: I’ve

source: ITU KEKNYA
en: think so.

source: DENGAN JIN BULUS
en: with Bulus

source: TIDAK PERMANEN,
en: permanent,

source: AKU SANGAT SERIUS
en: I’m taking this

source: CEREWET!!
en: will you?!

source: Tapi aku mau tanya dulu, kayaknya aku pesan lebih dari 1 buah pisang, deh..
en: oh, hang on a second. didn’t I order more than one banana?

source: WAAHHH!!
en: aaahhh!!!

source: HUB: +62 85 XXX
en: Call: +6285xxx

source: ..UJIAN DARI YANG MAHA KUASA..
en: you are being put through your paces by god.

source: EH!!
en: huh?!

source: Tentu saja, mbah Suro..
en: of course, master suro.

source: ..BALAS
en: retribution?

source: MELAWAN JIN PENUNGGU
en: still ongoing.

source: MEMBUTUHKAN
en: this job

source: WAH, KAYAKNYA AYAH PERNAH BACA SESUATU TENTANG TEMPAT ITU..
en: I think I’ve read about this place somewhere.

source: EH, SEBENTAR..
en: oh, hold on.

source: TANGKAP MEREKA BERDUA!!!!
en: get them!!!

source: ADALAH…
en: with...

source: Pulanggg??
en: we’re going home???

source: MAMAH JUGA TAHU TEMPAT INI DARI TANTE SHELLY, TERNYATA EMANG BAGUS SEKALI YA ALAMNYA!
en: I knew about this place from shelly, too. I never thought that it would be this beautiful!

source: ITU DAN BERSIKAP
en: and show the right amount of respect,

source: LINDUNGIN KAMU,
en: with my life,

source: KALAU BENAR BEGITU..
en: if what I’m thinking is true...

source: BANTULAH AKU
en: make sure

source: MANA ENGGAK ADA PEMBERITAHUAN SEBELUMNYA!!
en: we didn’t receive any prior notice of this road closure!

source: BAIK, PAK!!
en: yes, sir!

source: SAKIT SUDAH HABIS,
en: are over!

source: Kerasa nggak?
en: can you feel it?

source: HAHAHAHAH..
en: mwahahaha!

source: TUNGGU,
en: wait,

source: SAYA CERITAKAN
en: we

source: AKU SUDAH MENDAPAT-
en: your full

source: HATI-HATI
en: be more careful

source: AHH
en: arghhh

source: PAGI-PAGI
en: home

source: LEBIH BAIK KITA MEMUTAR SAJA!
en: it’d be safer if we take a detour.

source: Benar juga..
en: you’re right.

source: PUNYA BANYAK
en: have much

source: ARGGHH!!
en: argggh!!!

source: PAGI HARI HANYA BERTEMU SAAT SARAPAN, SETELAH ITU AYAH BURU-BURU NGANTOR AGAR TIDAK KENA MACET
en: we only saw each other in the morning at breakfast, and then he would pack up quickly to avoid the traffic.

source: AYAH AKAN MENG-
en: to go

source: MILIK WASA?
en: apartment, huh?

source: ABANG MAU MEN-
en: you’d listened to

source: MINNIE..!!
en: office!

source: LANJUT MAIN
en: continue our

source: Mulai besok, aku janji semua akan lebih baik lagi
en: everything will be fine from here on out, I promise.

source: LIHATNYA SAJA UDAH
en: even looking at him

source: KE KAMU??
en: come here?

source: SIBUK DI SINI
en: too busy

source: DIRIMU..
en: look at you...

source: Kurang ajar!!!
en: those scumbags!

source: AYAH KATANYA UDAH AMBIL CUTI?
en: dad, you said you took a day off, didn’t you?

source: DARI SINI?!!
en: we can do to help him!

source: BIASANYA SUDAH
en: you were

source: DUH, AKU NYERAH
en: argh, I give

source: ADIT MENGIRIM PESAN
en: he sent me

source: TAPI KACA-MATAKU!?!?
en: but... my glasses!

source: AKU ADALAH MILIK
en: I belonged to him

source: ..KEMUDIAN
en: then...

source: ANJAS LINCAH BANGET KAYAK MONYET!
en: anjas, you’re so agile, like a monkey!

source: NGGAK NYURUH
en: this isn’t

source: BERSAMA KITA!
en: see us!

source: TUBUHKU SEPERTI
en: earth's gravity

source: KAYAKNYA MAMA HARUS IKUT KELAS SENAM AEROBIK-NYA TANTE SHELLY LAGI, NIH...
en: I think I’ll have to take shelly’s aerobics class again.

source: TIDAKLAH PENTING..
en: is not important...

source: TENANG SAJA,
en: trust me,

source: ..JANGAN MENYEBAR
en: please stop

source: LUMAYAN ADA
en: he’ll be

source: SUNGGUH MENYEBAL-
en: such a pain

source: HARUS NYETIR KE KOTA
en: to the city

source: ..MAS
en: t-

source: TIDAK BISA
en: fulfill

source: KAU BERHASIL MENYERET-
en: to bring him

source: Jiwa-jiwa manusia yang sudah kami kumpulkan masih terjebak di lokasi, dan mayoritas klien dipindah tangankan secara sepihak
en: there are still human souls trapped in the location, and most of our clients have been taken from us without our consent.

source: KEMALEMAN,
en: late,

source: SESUATU, YA..
en: one thing.

source: BONEKA INI!!
en: on this piece of paper!

source: *BUKA BAJU*
en: *get undress*

source: AKU TIDAK BUTUH KAMAR!!
en: I don’t need a room!

source: SAMA SEKALI
en: even lay

source: Siapa yang nyalain kembang api, tuh>
en: who set them off?

source: Kalau dugaanku benar..
en: actually, I think...

source: ADA APA?
en: what is it?

source: PUTUS KONTAK
en: buddy.

source: Ampun, boss
en: sorry, boss!

source: LAKUKAN DENGAN
en: with

source: RAMPAS?
en: swindled?

source: KIKKK!!!
en: eek!!!

source: Kamu mengagetkanku saja...
en: you startled me...

source: *LEMPAR*
en: *throw*

source: DI SANA JALANNYA TERJAL DAN BANYAK JURANG!
en: there are many ravines and steep pathways up ahead!

source: Cara yang menurutmu "membuang potensi" ini terbukti masih membuatku bertahan sampai sekarang!
en: my “wasteful” method has been keeping me standing until today! it means that it’s working just fine!

source: DIAM!!
en: don’t say anything else!

source: ANAK BARU..!!
en: hey, new kid!

source: S..
en: wh-

source: Rencanaku adalah..
en: so... my plan is...

source: PENUNGGU POHON!!
en: jinn!

source: HE-HEI!!
en: h-hey!

source: HAH..
en: huff

source: KALAU AKU DATANG
en: to tell you first

source: NUNGGAK..
en: on the payment.

source: ..PAK, BU..?
en: excuse me...

source: KAMU MEN-
en: have you been

source: Tempat ini juga?
en: this place is also dangerous?

source: ANDA BERUSAHA LEBIH
en: you should deal

source: JADI MAKSUDMU..
en: so, are you saying

source: TUNJUKKANLAH
en: show

source: Poco-poco..
en: class?

source: ..MAAF YA,
en: I’m sorry

source: LAKU..
en: and do

source: MEMPERINGATKANMU
en: about this before!

source: Yaa..
en: yes, sir.

source: PERCAYA SAMPAI AKU
en: with my own eyes,

source: TRUK YANG ADA
en: the nearest truck

source: Tolong!!!
en: hello!!!

source: ADA SESUATU DI GUNUNG INI?
en: something in this mountain?

source: MBAH DAMAR!!
en: mr. damar,

source: AYO HADAP SINI, MAU MAMAH BIKIN BOOMERANG, NIH!
en: I want to record you, look over here!

source: KYAH…!!
en: ouch!!!

source: MBAK!
en: have

source: PADAHAL
en: I swear

source: Kalau nggak gitu, bagian cerita ini bakal selesai dalam tiga episode saja..
en: otherwise, the rest of the story would be wrapped up in just three episodes.

source: Mamah...
en: mom...

source: KENAPA KAMU
en: why did you

source: KKKHHH---!!
en: arghhh!

source: JANGAN MARAH (1)
en: don’t be mad (1)

source: NYA PADA AYAHKU!!
en: I’ll report you to my dad!

source: Karena tuan sudah baik sama saya, jadi saya selipkan bonus, nih, semoga nggak ketahuan..
en: since you’ve been so nice to me, I've tucked in an extra meal. I hope they didn’t notice.

source: ADINATA
en: HOSPITAL

source: BARUSAN
en: yeah, he just told me.

source: SUDAH SELESAI,
en: so we’d better get back to work.

source: TERUS SETELAH ITU NGELIATIN APALAGI?
en: then what were you looking at?

source: *MEMBATU*
en: *freeze*

source: Tsk-- Ternyata dia belum tidur...
en: oh... he’s still up.

source: *SAMBAT*
en: *grumble*

source: YA ITU KAN BIAR JADI TANGGUNGJAWAB MEREKA, YAH!!
en: make it their responsibility to handle it!

source: JADI, SIAPA
en: so,

source: BESOKKK!?!?
en: tomorrow?!

source: AKU YANG SEKARANG
en: at this rate,

source: SESUATU, TUAN!!
en: something, master!

source: DI SUNGAI?!?!
en: into the river?!

source: ..ADA SUARA
en: even with

source: LONG..!!
en: help!

source: HEI, MAS!!
en: hey!

source: ATAU KELUARGANYA
en: his family

source: KALIAN, PARA
en: scarce,

source: MONYET..!!
en: is a monkey...

source: Ampun, tuan!!
en: sir, please have mercy!

source: HEHEHEH!!
en: hahaha...

source: ..SIAPA SIH?!
en: who’s he?!

source: WAH KAMU PASTI SUDAH MENGALAMI BANYAK COBAAN HIDUP YA, MUNKI..
en: poor you... you’ve been through a lot, munki!

source: GROAAA
en: whoosh

source: SIMBAH YANG PERCAYA
en: times have

source: SARIMIN SI JIN
en: sarimin the white

source: DOLLAR LAGI NAIK,
en: if the dollar soared high!

source: MENGANTAR-
en: taking

source: NGGAK CUMA DI SINI..
en: he acts like this...

source: ..UMUR MEMANG
en: I guess

source: SEDIKIT ITU, YA?
en: clients, huh?!

source: TIDUR SEBENTAR..
en: rest for a bit...

source: SEPERTI DATANG
en: reverberates

source: Kuanggap hutangmu lunas, tapi jangan kaget kalau suatu saat aku datang lagi untuk menagih bunga-nya, hahahaha
en: alright, your debt has been repaid, but I may still come back in the future to collect the interest, hahaha.

source: AKU TIDAK INGIN BERPIKIRAN BURUK..
en: I don’t want to dwell on these dreadful ideas.

source: CEPAT DISELESAIKAN
en: and

source: TIRTA TIDAK
en: wasn’t

source: (BIARKAN AKU NAIK DULU, NANTI AKU CERITAIN!!)
en: (let me go up there first, then I’ll tell you everything!)

source: *LEPAS*
en: *let go*

source: CARIKU, YA?
en: looking for me?

source: HARUS AKU?!
en: why

source: KENAPA YA, PAK?
en: “it’s not safe”?

source: DI KEBON YANG
en: on this empty

source: SAAT AKHIR PEKAN AYAH JUGA MASIH SUKA SIBUK..
en: even on the weekends, he’d be at work.

source: HABIS, KITA HARUS
en: over, we need to see him

source: ..HAMPIR NGGAK
en: I have nothing

source: MATA KEPALAKU
en: any of

source: HARUS KALIAN BAYAR
en: you must present me

source: AH, TIDAK..
en: no...

source: KOK KAMU BISA SAMPAI SINI, SIH!?
en: how did you manage to get here?!

source: SEKARANG ADA
en: the technology

source: HUP!
en: take this!

source: SHHH--!!!
en: ssh!!!

source: Apapun yang kau pilih, kau tetap haris memulihkan diri dulu, sarimin
en: no matter what you choose, you need to get better first, sarimin.

source: TENTU SAJA!!
en: of course!

source: KAUM KALIAN SENDIRI
en: each other.

source: GHOIB?
en: this world?

source: AKU KAN MEMANG ISTRI YANG KREATIF, SOLID, DAN INOVATIF, YAH!!
en: well, of course! you know I’m a creative, reliable, and innovative wive.

source: KITA LANJUT LAGI
en: we’ll do it again

source: ...KIKKK???
en: eek???

source: MERASA TIDAK
en: feel

source: WADAW!!
en: ouch!

source: DEK TRESNO
en: it seems like

source: Tuan Sarimin..?
en: mr. sarimin!

source: A… APA-APAAN?!
en: wh-what’s going on?!

source: ..EHHH??!
en: huh?!

source: Seharusnya aku tidak pernah membiarkanmu menginjakkan kaki di sini..
en: I shouldn’t have let you stay here in the first place.

source: AKU TERCEKIK!!
en: it’s strangling me!

source: Nasib lelembut-lelembut di gunung ini ada di tanganku..
en: I hold the power to decide the fate of the departed who roam this mountain.

source: KAU SEPERTINYA SUDAH
en: I guess you’ve

source: MENGENALIKU SEBAGAI
en: who recognized me

source: TURUTI SAJA
en: just do

source: ITU SEMUA HANYA
en: really just

source: GANGGU?!
en: who owns the place?

source: PAT..
en: four...

source: NYAWAMU!!
en: your life!

source: DENGAN ILMU HITAM
en: into a boar by using black magic.

source: JADI KAMU, DUITNYA
en: I’d take

source: KURA NINJA…
en: turtle shaman...

source: AKAN KUTUNGGU
en: you’d better make sure

source: BUCINKU…
en: I can’t believe

source: SEBELUMNYA…
en: ago

source: BERHENTI SEJENAK
en: for a brief moment.

source: KA..
en: y-

source: Ditinggal pas sayang sayangnya?!?!?!?!
en: “love ‘em and leave ‘em”?!

source: ..PAK JUNAEDI?!
en: mr. junaedi?!

source: BIAR RAME KITA SETEL LAGU, YAAA ~
en: let’s play a song to spice things up!

source: TINGGI!!
en: so high,

source: DEK, LELAKI LAIN
en: look, I know

source: ADA FESES KUCING!
en: there’s a cat poop!

source: MUNCUL
en: it

source: AKU JUGA NGGAK
en: I don’t plan

source: PAK JUNAEDI JUGA
en: mr. junaedi

source: KAPAS, MELAYANG..
en: being blown by the wind...

source: DONG!!!
en: ratna?!

source: YAH,
en: aww,

source: INI BERHUBUNGAN
en: this has

source: DRRA
en: rumble

source: BERANINYA KAU
en: wow dare you

source: NIH POHON?
en: about this tree?

source: BUATKU, TAPI..
en: from them, but...

source: KE SINI SEKITAR 3-4
en: 3-4 hours

source: TRESNO BARU SAJA
en: funeral

source: ..CANDLE LIGHT
en: you can just go

source: PAK BOSS 'J'
en: big boss “J”

source: CEPET BANGET?!
en: that was fast!

source: ITU ULAR PUTIH
en: a familiar in the form

source: KELUARKAN, HAH?!
en: huh?!

source: Cepat kabur dari sini!!
en: let’s get out of here!!!

source: KEMENYAN!!
en: incense!

source: AKU SUDAH MEM-
en: I

source: BELUM ADA DEVELOPER YANG MAU MENGAMBIL ALIH PROYEKNYA
en: and no developer wishes to continue the project.

source: Kami harus segera bertindak untuk mengajukan klaim terhadap wilayah tersebut ke organisasi pusat,
en: therefore, a claim against the territory needs to be made to the central organization as soon as possible.

source: CARA AKU PERGI
en: to get out of

source: MASIH TAHAP PEM-
en: we’re still in the

source: MALAS MELADENI
en: are the last people

source: Bernasib sama sepertiku?
en: “to end up like me”?

source: EH?
en: huh?

source: SELESAI, KAN?
en: yet!

source: LAGA..
en: scenes, huh?

source: MENYEDIHKAN!!
en: a joke!

source: JIKA KAU
en: if you’re

source: UNTUK MENCURI UANG
en: they usually do this to steal money.

source: APA INI..!?
en: this feeling?!

source: MALAM ITU..
en: that night...

source: MBAH DAMAR
en: master damar

source: CKLICK!
en: click

source: LENGKAPAN DUA KALI,
en: your equipment,

source: AKU BELUM CUKUP
en: I wasn’t

source: MENCOBA BEBE-
en: try again

source: SEKITAR 800 JUTAAN,
en: you’ll earn at least 800 millions rupiah,

source: DAN AYAH
en: and

source: AKU TIDAK MENJANJIKANMU APA-APA...!!!
en: I didn’t promise you anything!

source: KULENYAPKAN SAJA
en: I had known

source: INGINKAN DENGAN
en: in order to

source: KHH--!!
en: gah!

source: APA?
en: what?

source: ENAK..
en: so good...

source: BERKATNYA..
en: thanks to you,

source: Ternyata Cuma room service
en: huh, it’s just room service.

source: DARI MEREKA MENGAKU
en: of being visited

source: Hei, Noor Hadi!
en: hey, noor hadi!

source: LAMA-LAMA KALIAN JUGA
en: Sooner or later,

source: SARIMIN..
en: you’ve been

source: SUDAH DULU
en: that’s enough practice

source: MONYET YANG MENGERIKAN
en: a monkey mask.

source: BADUMM!!
en: kaboom

source: HARUS MULAI
en: I need to pray more

source: AKU HANYA
en: I’m here

source: BENARKAH
en: were they

source: Kurasa aku bisa memenuhi permintaanmu..
en: I think I can help.

source: Aku mau nyalain lagi nih, biar makin ramay!!
en: maybe we need to light some more to make things more festive!

source: KIKKK!!
en: eekkk!!!

source: B-BERTAHANLAH!!
en: h-hold on!

source: ULARNYA
en: it’s getting

source: SEPERTI TADI, KALIAN
en: about to do not too long ago,

source: NGEPET, YA?!
en: a boar demon?!

source: Dengarkan proposal lengkapku dulu, Sima!!
en: let me finish presenting my business proposal, sima!

source: BENTAR YA,
en: can you give me a sec?

source: SEDALAM 3 METER!!
en: deep hole!

source: PEKERJAAN INI UNTUK
en: to pay for

source: SAJA UP!
en: updated!

source: MEMANGGIL BUDAKKU,
en: to see my slave,

source: GERCEP JUGA PARA
en: those humans

source: KE SINI, BANG?
en: seen you before.

source: JIN BULUS ITU?!
en: bulus jimbung?!

source: Aku nggak bisa terus-terusan membantumu, Sarimin..
en: I can’t always be there for you, sarimin.

source: BANYAK JUGA..
en: a lot...

source: UNTUK BERMAIN-
en: to mess around

source: TIDAK KUSANGKA AKAN JADI SEPERTI INI...
en: but, I didn’t expect it’d turn out this way.

source: BERAT..
en: ask...

source: Terdengar menyenangkan..
en: sounds fun.

source: HANDPHONE YANG
en: can no longer

source: DUNIA KALIAN!!
en: to your world!

source: AKAN BENAR-
en: I’ll take

source: KENAPA..
en: but...

source: SILAHKAN DIMINUM DULU TEHNYA, BU..
en: have some tea, ma’am...

source: ..SAMPAI
en: until

source: JRENG..
en: dun

source: Apa yang membuatmu berubah pikiran, Sima?
en: what made you change your mind, sima?

source: SANG DETEKTIF (5)
en: the detective (5)

source: BENAR KUAMBIL,
en: your leg

source: PENGENDARA KURANG AJAR!!
en: hey, you insolent punk!!!

source: CAMPING GROU
en: CAMPGROUND

source: GANTI
en: of clothes.

source: KAU JUGA MENDENGAR
en: you heard

source: PERNAH MENGHADAPI
en: he’s fought

source: KENAPA ADA
en: there’s

source: APARTEMEN
en: wasa’s

source: NAIK-NAIK KE PUNCAK GUNUNG (3)
en: let’s climb to the mountain top (3)

source: JIN TIDAK PERNAH
en: this jinn

source: BEGINI
en: early today.

source: Kenapa disisain dua?
en: but why did you let two of them live?

source: BANGUNLAH,
en: wake up,

source: MEMPERTEMUKANMU
en: let you

source: A-AYAH
en: d-dad...

source: Kalian pikir ini main-main?!
en: I’m not buying it!

source: Fyi, olahraga sudah terbukti berhasil meningkatkan suasana hati, lho!
en: random fact: it has been proven that exercise improves mood!

source: Kau bisa berterima kasih setelah kita sampai tujuan..
en: you can thank me once we get to our destination.

source: ..EH?
en: huh?

source: APA YANG TERJADI?!
en: what’s going on?!

source: GOSIP ADALAH FAKTA YANG TERTUNDA
en: GOSSIPS ARE UNPROVEN FACTS

source: Baiklah..
en: fine...

source: ADIT SUDAH
en: adit has

source: HENTIKAN PEN-
en: we need to stop

source: Apakah anda polisi yang sedang menyamar?
en: are you an undercover cop or something?

source: BAPAKEEE!!!
en: sir!!!

source: JAM YANG LALU
en: half an hour

source: Apa yang..
en: what...

source: Kami hanya memastikan kalau anak-anak bapak akan tidur dengan sangatt nyenyak malah ini!!
en: we’re just checking in to make sure your kids are getting a good night’s sleep.

source: Yang mereka inginkan adalah..
en: what they really want is...

source: PULANG?
en: you home?

source: KUMOHON..
en: please

source: KITA LANGSUNG KE
en: let’s get straight

source: KUMOHON JANGAN
en: please

source: NALIMU..
en: you.

source: TADI MALAM…
en: from last night?

source: BANGSA KALIAN
en: your kind

source: Ayah sudah mengacaukan semuanya..
en: I’ve ruined our vacation...

source: KAN..
en: something,

source: GETAHNYA JUGA
en: get caught in the crossfire, you know.

source: MACAM-MACAM
en: this tree either.

source: ..AKU MEN-
en: I got his

source: PAK SUNARYO
en: tsk... mr. sunaryo

source: LEBIH DARI INI!!
en: stronger!

source: KAN PADAMU, DIT..
en: I’m about to offer you.

source: MAIN DENGANMU
en: with you.

source: KUNJUNGAN TELAH
en: the visiting hours are

source: ANDA LAKUKAN
en: doing here,

source: Lagi seru-serunya, nich, kakkk!!!
en: I’m in the middle of the most exciting part of the comic!

source: ..BISA-BISA
en: darn it,

source: SINI SEBENTAR!!
en: come here a minute!

source: GINJALMU
en: how about

source: ULAR..!!
en: a snake

source: Yaudah, aku taruh di meha situ aja, dehh...
en: right, I’ll just put this on the table then.

source: DIMANA KAMU?
en: where are you?!

source: Malah ketawa-ketiwi!!
en: stop laughing!

source: ..PAK
en: mr.

source: Siapa anda?
en: who are you?

source: BERANINYA KAU MENGANGGU TIDUKU...!!!!
en: how dare you disturbing my sleep!!!

source: JALUR ALTERNATIF?
en: a different route?

source: Saya akan berusaha!
en: I’ll do my best!

source: Untuk (diawasi / diminta keterangan /
en: To be apprehended

source: Kita tidak punya pilihan lain, kan?
en: do we even have a choice?

source: AKU AKAN SEGERA
en: I’ll

source: MAKHLUK SEM-
en: means

source: JANGAN MARAH (2)
en: don’t be mad (2)

source: Cepat sebelum mereka kabur!!!
en: hurry! they’re about to get away!!!

source: Tunggu aba-aba dariku
en: wait for my mark.

source: KUHH--
en: ugh!

source: INI…!!!
en: this!!!

source: LUM..
en: it’s

source: KUDENGAR DARI
en: the boss

source: ENGKAU ADALAH
en: you

source: AWAL..!!
en: you!

source: LAIN KALI AKU
en: I’ll be

source: UDAHAN, NIH?
en: finished with your business?

source: BICARAAN KALIAN
en: conversation.

source: SEMALAM..
en: well, last night,

source: SEBELUM AKU
en: or else you’re gonna suffer

source: KELIHATAN BANGET KALAU NGGAK MAU BERADA DI SINI...
en: doesn’t seem like he wants to be here.

source: Penjaga..?
en: guards...?

source: Hahhh?!
en: man...

source: PUTRI SEMATA
en: my sweet

source: TERLEBIH DAHULU!!
en: first!

source: SAYA,
en: talking

source: DALAM MENGHADAPI-
en: very

source: MENGANGGAP SEMESTA
en: that the whole universe

source: DEK NATASYA!!
en: natasya!

source: Meskipun dengan pelayan sepertiku..
en: even to a maid like me...

source: KALAU BEGINI,
en: at this rate,

source: Woy!!
en: hey!

source: SEGITU SAJA..
en: of it, sir.

source: BENGONG!!
en: at the clouds!

source: PA..
en: I need

source: AWAL-AWAL, AKU
en: so maybe

source: HAH...
en: oh my...

source: AKU TAKKAN
en: I won’t

source: AARGGHHH!!
en: arghhh!!!

source: DI NEGERI INI..!
en: in the entire world!

source: BUKAN..?!
en: or did all of that really happen?!

source: DI KEBON GINI LAH,
en: at least get a proper room,

source: SEBAGAI SUAMI
en: as a husband

source: TAHUN INI..
en: few years,

source: MENGHABISIKU
en: to finish me off

source: GROOKKK..
en: snort

source: WOEEEYY!!!
en: oi!!!

source: KEV..
en: kevin.

source: INI..!!
en: this!!!

source: AH-SOAL ITU!!
en: oh, about that!

source: Storu & Art :
en: story & art:

source: ..KAU!!!
en: you?!

source: DENGANKU, YA?!
en: are you?!

source: Jenis Kelamin
en: Sex

source: NANNYA SELESAI!!
en: it’s too late!

source: DARI PELAJARAN
en: learned

source: WONG GUENDEENGG!!
en: screw you, you useless cop!!!

source: Terjadi?
en: happened to me?

source: MAS LINCAH BANGET
en: you’re so agile!

source: AKU AKAN BOBOK DI TENDA!!
en: I want to sleep in the tent!

source: GINI AJA UDAH
en: the exercise,

source: KALAU POTRAIT PEMANDANGAN-NYA KEPOTONG, DONG!
en: so that it’ll also capture the scenery.

source: Kau pikir aku seperti manusia?!
en: what do you take me for? a human?!

source: *CELINGUK*
en: *look around*

source: ..KECELAKAAN
en: he had

source: ..TOLONG
en: ...please

source: KEMANA
en: hmm...

source: NGGAK BISA, AYAH AKAN KE LUAR KOTA, ADA PEKERJAAN!
en: sorry, I can’t make it. I’m going out of town for work.

source: KAMU TUNGGULAH DI POS..
en: wait for us at the post,

source: TERLUKA MAS JADI
en: to see you

source: KIKKK...
en: eek...

source: BUKAN SATU-SATUNYA
en: are not the only ones

source: MEMINJAM KEKU-
en: I decided to borrow

source: APAKAH MASIH
en: are some of the victims

source: Ah, itu akan sulit untuk dijelaskan...
en: ah... how should I put this?

source: CKIIITT!!
en: screech

source: AKAN BISA BEKERJA
en: to work

source: BARANGAN!!
en: business!

source: GILKU KE SINI!!!
en: me here!

source: YA SUDAH,
en: let’s just

source: JIN ITU….
en: that jinn, huh?

source: DIRIMU, TAPI TERNYATA
en: but I guess

source: ANEHNYA,
en: weirdly enough,

source: DUAK!!
en: whack

source: SEKARANG AKU AKAN
en: now, I’ll show you

source: MEMBESAR?!!?
en: bigger!

source: TOH SEBENTAR LAGI
en: you know what,

source: MAS-MAS
en: I think

source: SUDAH LEBIH DARI
en: has been

source: ZHA A
en: whoosh

source: NIH, TISSUE
en: here, wipe your tears.

source: KU SENDIRI..!!
en: myself!

source: DIA LAGI NGEPET
en: serious

source: KALI, YA??
en: with my gut feeling.

source: BIKIN GERAH!!
en: makes me feel hot.

source: TIDAK AKTIF ATAU
en: is busy

source: Sini biar kutunjukkan caraku--
en: let me show you how I handle things--

source: MBAK!!
en: can you hold

source: HITUNGANNYA APES
en: I’m not sure if we should be happy

source: Saya ada janji dengan tuan Sarimin, hehe..
en: I have an appointment with him, hehe.
